Repository: 84000/data-translation-memory
Catalog: toh65-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྒྱུ་མ་མཁན་བཟང་པོ་ལུང་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །
en: The Noble Mahāyāna Sūtra The Prophecy for Bhadra the Illusionist

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་གྲགས་པ། མངོན་པར་གྲགས་པ་མངོན་པར་ཤེས་པ་ཐོབ་པ། གཟུངས་ཐོབ་པ། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ཐོབ་པ། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ལྔ་སྟོང་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེ་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཙན་དན་བཟང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁ་ལོ་སྒྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁ་ལོ་སྒྱུར་བ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་བྱེད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་གཟི་བརྗིད་དང་ལྡན་ཞིང་ང་རོ་སྙན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་བཀོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གསལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་གྱི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཁ་ལོ་སྒྱུར་བ་དུལ་བ་དང་ལྡན་པ་དང་། བྱམས་པ་ལ་སོགས་པ་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྔ་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was dwelling at Vulture Peak Mountain near Rājagṛha together with a saṅgha of 1,250 monks and five thousand renowned bodhisattva mahāsattvas—renowned for having attained the superknowledges, the retentions, the miraculous power of magical display, and acceptance that phenomena are unborn—such as the bodhisattva mahāsattva Siṃha, the bodhisattva mahāsattva Siṃhamati, the bodhisattva mahāsattva Fine Sandalwood, the bodhisattva mahāsattva Sārathi, the bodhisattva mahāsattva Mahāsārathi, the bodhisattva mahāsattva Prabhāśrī, the bodhisattva mahāsattva Radiant, the bodhisattva mahāsattva Endowed with Brilliant Light and Having a Melodious Voice, the bodhisattva mahāsattva Prabhāvyūha, the bodhisattva mahāsattva Clear Mind, the bodhisattva mahāsattva Essence of Beings, the bodhisattva mahāsattva Disciplined Charioteer of Beings, all the bodhisattva mahāsattvas of the Fortunate Eon, such as Maitreya, and other bodhisattvas such as Mañjuśrīkumārabhūta and so forth.

source: ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་ཡང་ཐབས་ཅིག་གོ །
en: Śakra, ruler of the gods, was also there with them.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་ཡང་ཐབས་ཅིག་གོ །རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་ཡང་ཐབས་ཅིག་གོ །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་།
en: Brahmā, the lord of this world Endurance, was there, too, as were the Four Great Kings.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། དྲི་ཟ་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དུ་མས་ཀྱང་ཡོངས་སུ་བསྐོར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ནི་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ལ་རྟེན་ཅིང་བཞུགས་ཏེ། རྒྱལ་པོ་དང་།
en: Many gods, nāgas, yakṣas, asuras, garuḍas, gandharvas, kinnaras, and mahoragas also surrounded them.

source: བློན་པོ་ཆེན་པོ་རྣམས་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། གྲོང་རྡལ་དང་། ལྗོངས་ཀྱི་མི་རྣམས་ཀྱིས་ནི་གུས་པར་བྱས། བླ་མར་བྱས། བསྙེན་བཀུར་བྱས། མཆོད་པ་བྱས་སོ། །
en: While the Blessed One was residing near the great city of Rājagṛha, kings, chief ministers, brahmins, householders, and people of the villages and countryside all paid respect, venerated, served, and made offerings to him.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་གོས་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆ་དང་། གདན་དང་། སྙུན་གསོས་དང་། སྨན་ཟོང་ནི་བརྙེས།
en: The Blessed One received robes, food, bedding, seats, and medicines to cure the sick.

source: བཅོམ་ལྡན་འདས་ཀྱི་གྲགས་པ་དང་། སྙན་པ་དང་། ཚིགས་སུ་བཅད་པ་རྒྱ་ཆེན་པོ་ནི་མངོན་པར་འཕགས་ཏེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: Extensive verses of praise further elevated the Blessed One’s fame and reputation.

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ། ཐམས་ཅད་གཟིགས་པ་དང་ལྡན་པ་སྟེ། ཐམས་ཅད་ནི་མཁྱེན། ཐམས་ཅད་ནི་གཟིགས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ནི་ལྡན། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་དང་ནི་ལྡན།
en: Thus the tathāgata, arhat, complete and perfect Buddha accomplished in knowledge and conduct, the Sugata, the knower of the world, the unsurpassed guide who tames beings, the teacher of gods and humans, the Blessed Buddha—the all-knowing and all-seeing one—knew all and saw all and was endowed with the ten strengths of a tathāgata, the four fearlessnesses of a tathāgata, and the four correct discernments.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ནི་ལྡན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་ནི་ལྡན། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ནི་ལྡན།
en: He was endowed with the eighteen unique qualities of the buddhas, great loving-kindness, and great compassion.

source: སངས་རྒྱས་ཀྱི་སྤྱན་ཉམས་པ་མི་མངའ་བ་དང་ནི་ལྡན། སྤྱན་ལྔ་དང་ནི་ལྡན། ཆོ་འཕྲུལ་ཡང་བརྙེས་ཏེ། ཀུན་རྗོད་པའི་ཆོ་འཕྲུལ་ནི་བརྙེས། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་ནི་བརྙེས། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ནི་བརྙེས་སོ། །བཞེད་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གྲོང་ཁྱེར་དང་བཅས་པ། གྲོང་རྡལ་དང་བཅས་པ། ས་དང་བཅས་པ། འགྲོ་བ་དང་བཅས་པ། རི་རབ་དང་བཅས་པ།
en: He was endowed with the unfailing buddha eye and the five eyes, and he had also gained miraculous powers: the miraculous power of foretelling, the miraculous power of instruction, and the miraculous power of magical display.

source: རྒྱ་མཚོའི་མཐས་གཏུགས་པ། ལྷའི་གནས་དང་བཅས་པ། ཁོར་ཡུག་དང་འོབས་སུ་བཅས་པ། རྩྭ་དང་། ཤིང་དང་རིར་བཅས་པ་འདི་ནམ་མཁའ་ལ་བསྐལ་པ་འམ།
en: If he wished, he could suspend this trichiliocosm—including its cities, towns, lands, beings, and Mount Merus, encompassing everything up to the edges of the oceans and including the abodes of the gods, the horizons and depths, and the grasses, trees, and mountains—on the tip of a hair in space for an eon or even longer than an eon.

source: བསྐལ་པ་བས་ཀྱང་ལྷག་པར་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱིས་འཛིན་པར་མཛད་དོ། །ཡང་དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་སྒྱུ་མ་མཁན་བཟང་པོ་ཞེས་བྱ་བ་བསྟན་བཅོས་ལ་ཤིན་ཏུ་མཁས་པ།
en: At that time, an illusionist named Bhadra lived in the city of Rājagṛha.

source: གསང་སྔགས་ལ་ཤིན་ཏུ་མཁས་པ། བཟོ་དང་རིག་པ་ལ་འབྱམ་པ། ལས་ཀྱི་མཐའ་བྱས་ཟིན་པ། རབ་ཏུ་བྱེད་པ་བྱས་པ། སྒྲ་གྲགས་པ། ཡུལ་མ་ག་དྷ་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་ཇི་སྙེད་པ་དེ་དག་གི་མཆོག་ཏུ་གྲགས་པ། ཕུལ་དུ་གྲགས་པ་ཞིག་གནས་ཏེ།
en: He was highly versed in the treatises and secret mantra, a master of knowledge and craft, highly accomplished, successful, and famous.

source: དེས་ཡུལ་མ་ག་དྷ་རིལ་གྱི་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་འདུན་པར་བྱས། རྨོངས་པར་བྱས། མགོ་འཁོར་བར་བྱས་ནས་ཡ་མཚན་གྱི་ཆོས་ལ་བཀོད་དེ། བདེན་པ་མཐོང་བ་རྣམས་དང་། དད་པ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་ནི་མ་གཏོགས་སོ། །
en: He was known as the greatest of all the illusionists and disciples of illusionists in Magadha, and by dint of his fame, he enthralled, bewildered, and deceived all the throngs of people in Magadha and converted them to his spectacular ways, except for those who had seen the truth, had faith, and followed the Dharma—the lay devotees, men and women.

source: དེས་སྒྱུ་མས་རྨོངས་པར་བྱེད་པའི་རིག་པའི་སྟོབས་བསྐྱེད་པས་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཡང་ལྷག་པར་རྙེད་དོ། །སྒྱུ་མ་མཁན་བཟང་པོས་བཅོམ་ལྡན་འདས་ཀྱི་གྲགས་པ་དང་། སྙན་པ་དང་། ཚིགས་སུ་བཅད་པ་ལྷག་པར་མངོན་པར་འཕགས་ཏེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ། ཐམས་ཅད་གཟིགས་པ་སྟེ། ཐམས་ཅད་ནི་མཁྱེན། ཐམས་ཅད་ནི་གཟིགས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ནི་ལྡན། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་དང་ནི་ལྡན། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ནི་ལྡན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་ནི་ལྡན།
en: Through his illusions, he became powerful in the craft of bewilderment and acquired tremendous profits, respect, and verses of praise.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ནི་ལྡན། སངས་རྒྱས་ཀྱི་སྤྱན་ཉམས་པ་མི་མངའ་བ་དང་ནི་ལྡན། སྤྱན་ལྔ་དང་ནི་ལྡན། ཆོ་འཕྲུལ་ཡང་བརྙེས་ཏེ། ཀུན་རྗོད་པའི་ཆོ་འཕྲུལ་ནི་བརྙེས། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་ནི་བརྙེས། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ནི་བརྙེས་སོ། །བཞེད་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གྲོང་ཁྱེར་དང་བཅས་པ། གྲོང་རྡལ་དང་བཅས་པ། ས་དང་བཅས་པ། འགྲོ་བ་དང་བཅས་པ།
en: Bhadra the illusionist heard that the fame, renown, and verses of the Blessed One were superior and that he was known as the tathāgata, arhat, complete and perfect Buddha accomplished in knowledge and conduct, the Sugata, the knower of the world, the unsurpassed guide who tames beings, the teacher of gods and humans, the Blessed Buddha, the all-knowing and all-seeing one who knows all and sees all, who is endowed with the ten strengths of a tathāgata, the four fearlessnesses of a tathāgata, and the four correct discernments and who is endowed with the eighteen unique qualities of the buddhas, with great loving-kindness and great compassion, and with the unfailing buddha eye and the five eyes, and as one who has gained miraculous powers: the miraculous power of foretelling, the miraculous power of instruction, and the miraculous power of magical display.

source: རི་རབ་དང་བཅས་པ། རྒྱ་མཚོའི་མཐས་གཏུགས་པ། ལྷའི་གནས་དང་བཅས་པ། ཁོར་ཡུག་དང་འོབས་སུ་བཅས་པ། རྩྭ་དང་ཤིང་དང་རིར་བཅས་པ་འདི་ནམ་མཁའ་ལ་བསྐལ་པའམ། བསྐལ་པ་བས་ལྷག་པར་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་ལ་འཛིན་པར་མཛད་དོ་ཞེས་ཐོས་སོ། །
en: If he wished, he could suspend this trichiliocosm—including its cities, towns, lands, beings, and Mount Merus, encompassing everything up to the edges of the oceans and including the abodes of the gods, the horizons and depths, and the grasses, trees, and mountains—on the tip of a hair in space for an eon or for even longer than an eon.

source: ཐོས་ནས་ཀྱང་ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཡུལ་མ་ག་དྷ་རིལ་གྱི་སྐྱེ་བོ་ཐམས་ཅད་བདག་གིས་འདུན་པར་བྱས། རྨོངས་པར་བྱས། མགོ་འཁོར་བར་བྱས་ནས་ཡ་མཚན་གྱི་ཆོས་ལ་བཀོད་དེ།
en: When he heard this, he thought, “I have enthralled all the people of the land of Magadha, bewildered them, deceived them, and converted them to my spectacular ways.

source: བྲམ་ཟེ་དང་། ཁྱིམ་བདག་ཆེན་པོ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་བདག་གི་མིང་གིས་རབ་ཏུ་མགུ་བར་གྱུར་ན།
en: All the brahmins and great householders delight in my name.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་གཅིག་པུ་ད་དུང་མ་བགམས། རྨོངས་པར་མ་བྱས།
en: The tathāgata, the arhat, the complete and perfect Buddha is the only one I have yet to put to the test.

source: མགོ་འཁོར་བར་མ་བྱས་ཀྱིས་མ་ལ་བདག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ག་ལ་བ་དེར་འགྲོ་བར་བྱའོ། །
en: Since I have not yet bewildered and deceived him, I must go immediately to the tathāgata, the arhat, the complete and perfect Buddha.

source: སོང་ནས་ཀྱང་བགམ་པར་བྱ་སྟེ།
en: When I get there, I will put him to the test.

source: གལ་ཏེ་རྨོངས་པའམ། མགོ་འཁོར་བ་བྱ་ནུས་པ་ལྟ་ན། དེ་ལྟ་ན་ཡུལ་མ་ག་དྷ་ཐམས་ཅད་བདག་ལ་གཅིག་ཏུ་འདུ་ལ། བདག་གི་རྙེད་པ་དང་། བཀུར་སྟི་ཡང་ཆེས་སྟོབས་དང་ལྡན་པར་འགྱུར་རོ་སྙམ་མོ། །
en: If they see that I am able to bewilder and deceive him, all of Magadha will follow me alone, and I will be bolstered with even greater profits and respect.”

source: དེ་ནས་ཡང་སྒྱུ་མ་མཁན་བཟང་པོ་སྔོན་གྱི་དགེ་བའི་རྩ་བས་བསྐུལ་བ་དང་། སངས་རྒྱས་ཀྱི་མཐུས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་སྟེ། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །སོང་ནས་ཀྱང་སྒྱུ་མ་མཁན་བཟང་པོས་དེ་བཞིན་གཤེགས་པ་ཉི་མ་བྱེ་བ་ཕྲག་འབུམ་པས་ལྷག་པའི་འོད་ཟེར་འབར་བ། ཞལ་ཟླ་བ་བྱེ་བ་ཕྲག་འབུམ་པས་ལྷག་པར་དྲི་མ་མེད་པ། སྐུ་ཤིང་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་ལྟར་ཆུ་ཞེང་གབ་པ།
en: Then Bhadra the illusionist, impelled by his previous roots of virtue and by the power of the Buddha, left the city of Rājagṛha and went to where the Blessed One was at Vulture Peak Mountain.

source: མཛོད་སྤུ་ནོར་བུ་དྲི་མ་མེད་པའི་འོད་དག་པ་ལྟར་གསལ་བ། སྤྱན་པད་མ་དང་། ཨུད་པ་ལ་སྔོན་པོ་ཁ་ཕྱེ་བ་ལྟ་བུའི་བཀྲག་ཡོད་པ། སྤྱི་གཙུག་ཚངས་པས་ཀྱང་བལྟར་མི་མཐོང་བ། འཁོར་གྱི་ནང་ན་གསུང་དབྱངས་ཡན་ལག་དྲུག་ཅུ་དང་ལྡན་པས་ཆོས་སྟོན་པ་མཐོང་ངོ་། །
en: Upon arrival, Bhadra the illusionist saw the Tathāgata, shining with light brighter than a trillion suns, with a face more immaculate than a trillion moons, with a body well proportioned like the king of banyan trees, with an ūrṇā as clearly apparent as the sparkling of a stainless jewel, with lotus eyes as lustrous as a blue utpala in bloom, and with an uṣṇīṣa whose top could not be seen even by Brahmā, teaching the Dharma amid his retinue in a melodious voice endowed with the sixty qualities.

source: མཐོང་ནས་ཀྱང་དེའི་སྐུ་དེ་ལྟ་བུ་མཐོང་། གསུང་གི་ཕྲིན་ལས་དེ་ལྟ་བུ་ཐོས་ནས་སེམས་དང་བར་གྱུར་ཅིང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Seeing this, seeing such a bodily form and hearing such awakened speech, Bhadra’s mind was calmed.

source: མ་ལ་བདག་གིས་འདི་ཅི་ཐམས་ཅད་མཁྱེན་ལ་ཐམས་ཅད་གཟིགས་པ་དང་ལྡན་པ་ཞིག་ཡིན་ནམ། འོན་ཏེ་མ་ཡིན་པ་བགམ་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Nonetheless, he thought, “I must test him at once, to find out for sure whether he is all-knowing and all-seeing or not.”

source: དེ་ནས་ཡང་སྒྱུ་མ་མཁན་བཟང་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བགམ་པའི་བསམ་པས་སང་གི་གདུགས་ཚོད་ལ་སྤྱན་འདྲེན་ཏོ་ཞེས་གསོལ་ཏོ། །
en: Then Bhadra the illusionist, bowing to the feet of the Blessed One and thinking to test him, said, “Please come tomorrow for the midday meal.”

source: འདི་སྙམ་དུ་ཡང་སེམས་ཏེ། ཅི་འདིས་བདག་གི་སེམས་ཤེས་སམ་འོན་ཏེ་མི་ཤེས་ཞིག་གུ།
en: At the same time, he was also thinking, “Does he know my intentions or not?

source: གལ་ཏེ་ཤེས་ན་ནི་དེར་འོང་བར་མི་འགྱུར་རོ། །
en: If he does know, then he will not come.

source: ཅི་སྟེ་མི་ཤེས་ན་ནི་དེས་ན་འོང་བར་འགྱུར་རོ་སྙམ་མོ། །
en: But if he does not know, he will come.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མ་མཁན་བཟང་པོ་གདུལ་བའི་དབང་དུ་ཡང་མཛད། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྐྱེ་བོ་ཕལ་པོ་ཆེ་གདུལ་བའི་དབང་དུ་ཡང་མཛད་ནས་མཁྱེན་བཞིན་དུ་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་ཏེ་ཅང་མི་གསུང་བས་གནང་བར་མཛད་དོ། །
en: Knowing this, the Blessed One, for the sake of taming Bhadra the illusionist, and for the sake of taming the masses of the city of Rājagṛha, gave his assent to Bhadra the illusionist by remaining silent along with his saṅgha of monks.

source: དེ་ནས་ཡང་སྒྱུ་མ་མཁན་བཟང་པོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Bhadra the illusionist thought, “Since my intention is to harm him and yet he has agreed, he must be neither all-knowing nor all-seeing.”

source: འདི་བདག་རྣམ་པར་མཐོ་འཚམ་པའི་བསམ་པ་དང་ལྡན་པ་ལ་འདིར་ཁས་ལེན་པ་དང་སྦྱར་ན་འདི་ནི་ཐམས་ཅད་མཁྱེན་པ་ཡང་མ་ཡིན་ལ་ཐམས་ཅད་གཟིགས་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་ནོ་སྙམ་ནས་དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: Then Bhadra the illusionist bowed to the feet of the Blessed One and departed from his presence.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སྒྱུ་མ་མཁན་བཟང་པོས་ནི་སྒྱུ་མའི་ཟ་མ་ཏོག་གིས་དགེ་སློང་གི་དགེ་འདུན་འདི་ལ་མཐོ་འཚམ་པར་འགྱུར་ལགས་སོ། །
en: Then Venerable Mahāmaudgalyāyana said to the Blessed One, “The illusionist Bhadra is going to harm this saṅgha of monks using his basket of illusions.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཁྱོད་སྙིང་ལས་ཆུང་བར་གྱིས་ཤིག་དང་།
en: The Blessed One replied, “Maudgalyāyana, do not worry!

source: ངས་ཡུན་རིང་པོ་ནས་སྤྱད་པ་བསྒྲུབས་པས་ན་དེ་བཞིན་གཤེགས་པ་ནི་འདིར་དུས་མཁྱེན་པ་ཡིན་ཏེ།
en: I have been engaging in correct conduct since long ago, and being a tathāgata, I know the proper time.

source: དེ་བཞིན་གཤེགས་པ་ལ་ནི་ལྟ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་ཐོ་བཙམ་པར་མི་ནུས་སོ། །
en: Not even the whole world with its gods can harm a tathāgata.

source: མཽད་གལ་གྱི་བུ་གཞན་ཡང་འདོད་ཆགས་ནི་མཐོ་འཚམ་པར་བྱེད་པ་ཡིན། ཞེ་སྡང་ནི་མཐོ་འཚམ་པར་བྱེད་པ་ཡིན།
en: “Indeed, Maudgalyāyana, desire is what causes harm, anger is what causes harm, and ignorance is what causes harm.

source: གཏི་མུག་ནི་མཐོ་འཚམ་པར་བྱེད་པ་ཡིན་ན། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བག་ལ་ཉལ་དང་བཅས་ཏེ་ཟད་བྲལ་ཡོངས་སུ་གྱུར། གཟོད་མ་ནས་མ་སྐྱེས་པའི་ཆོས་ཅན་ཡིན་ཏེ། དེས་ན་དེ་བཞིན་གཤེགས་པ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་ཐོ་བཙམ་པར་མི་ནུས་སོ། །
en: Since these, along with any latent tendencies, have been completely exhausted and forsaken by a tathāgata, who realizes that phenomena are primordially unborn, even the whole world with its gods cannot harm a tathāgata.

source: མཽད་གལ་གྱི་བུ་གཞན་ཡང་སྒྱུ་མ་མཁན་བཟང་པོའི་སྒྱུ་མ་ནི་ཕྱོགས་གཅིག་པ་ཡིན་པས་སྒྱུ་མ་ཡང་དག་པ་མ་ཡིན་གྱི། དེ་བཞིན་གཤེགས་པའི་སྒྱུ་མ་ནི་ཡང་དག་པ་ཡིན་ཏེ། དེས་ན་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: “Furthermore Maudgalyāyana, since the power of illusion of Bhadra the illusionist is limited, it is impure, while the power of illusion of a tathāgata is pure, since he is completely and manifestly awakened to all phenomena being like illusions.

source: མཽད་གལ་གྱི་བུ་སེམས་ཅན་གྱི་ཁམས་སུ་གདགས་པར་འདོགས་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་འདི་ལྟ་སྟེ། སྒྱུ་མ་མཁན་བཟང་པོའི་སྒྱུ་མ་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྒྱུ་མ་ལ་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ། སྟོང་གི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ། བྱེ་བ་འབུམ་གྱི་ཆར་ཡང་།
en: “Maudgalyāyana, even if all those multitudes designated as belonging to the realm of beings were to possess powers of illusion like that of Bhadra the illusionist, this would not even come close to a hundredth of a tathāgata’s power of illusion; nor would it even come close to a thousandth, nor a trillionth.

source: གྲངས་སུ་ཡང་། ཆར་ཡང་། བགྲང་བར་ཡང་། དཔེར་ཡང་ཉེ་བར་མི་འགྲོའོ། །
en: Nor would any such calculation, fraction, enumeration, or simile come close.

source: མཽད་གལ་གྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Maudgalyāyana, what do you think?

source: སྒྱུ་མ་མཁན་བཟང་པོས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་ཀུན་ཏུ་སྟོན་ནུས་སམ།
en: Is Bhadra the illusionist able to display this great trichiliocosm in its entirety, fully adorned with all its features?”

source: གསོལ་པ། མ་ལགས་སོ། །
en: “No, he is not,” replied Maudgalyāyana.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་བཞིན་གཤེགས་པ་ནི་བཞེད་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བརྒྱན་ཅིང་དེ་ཐམས་ཅད་ཀྱང་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་ལ་ཀུན་ཏུ་སྟོན་པར་མཛད་ཀྱང་།
en: The Blessed One continued, “If a tathāgata so wishes, he can display all the world systems as numerous as the grains of sand in the Ganges, fully adorned, on the mere tip of a hair.

source: དེ་བཞིན་གཤེགས་པའི་སྒྱུ་མ་རིལ་གྱིས་བསྟན་པར་ནི་མི་འགྱུར་རོ། །མཽད་གལ་གྱི་བུ་ཕྱོགས་བཅུ་ན་རླུང་གི་དཀྱིལ་འཁོར་གང་དག་ཡོད་པ་འདི་ལྟ་སྟེ། རླུང་གི་དཀྱིལ་འཁོར་རྣམ་པར་འཐོར་བྱེད་ཅེས་བྱ་བ་དང་། རླུང་གི་དཀྱིལ་འཁོར་ཡོངས་སུ་གཅོད་བྱེད་ཅེས་བྱ་བ་གང་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡོངས་སུ་གཅོད་པར་བྱེད་ཅིང་ཡོངས་སུ་བཅད་ནས་ཀྱང་འཇིག་པར་བྱེད་པ་དང་། རླུང་གི་དཀྱིལ་འཁོར་ཀུན་ཏུ་འཐོར་བྱེད་དང་། རྣམ་པར་འཐོར་བྱེད་ཅེས་བྱ་བ་འཇིག་རྟེན་གྱི་བར་ན་རྒྱུ་བ་གང་དག་ཡིན་པ་དང་། རླུང་གི་དཀྱིལ་འཁོར་ཀུན་ནས་ཡོངས་སུ་འཇོག་པ་ཞེས་བྱ་བ་སྲིད་པའི་རྩེ་མོ་ན་རྒྱུ་བ་གང་དག་ཡིན་པ་དང་། རླུང་གི་དཀྱིལ་འཁོར་རྣམ་པར་འཇིག་པ་ཞེས་བྱ་བ་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱང་རྣམ་པར་འཇིག་པར་བྱེད་ན། རི་ཕལ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་གང་དག་ཡིན་པ་དང་།
en: But even this would not show the full extent of a tathāgata’s power of illusion.

source: རླུང་གི་དཀྱིལ་འཁོར་འབར་བྱེད་ཅེས་བྱ་བ་སྲེག་པའི་བསྐལ་པའི་ཚེ་ལྡང་ཞིང་གང་གིས་ན་མེ་ལྕེ་དེ་དག་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་འཕེན་པར་བྱེད་པ་དང་། རླུང་གི་དཀྱིལ་འཁོར་རྣམ་པར་སྒྲུབ་བྱེད་ཅེས་བྱ་བ་གང་གིས་སྲེག་པའི་བསྐལ་པའི་མེ་དེ་ཞི་བར་བྱེད་པ་དང་། རླུང་གི་དཀྱིལ་འཁོར་རབ་ཏུ་ཚིམ་བྱེད་ཅེས་བྱ་བ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྤྲིན་གྱི་དྲ་བ་གཅིག་གིས་ཀུན་ཏུ་ཁེབས་པར་བྱེད་པ་དང་། རླུང་གི་དཀྱིལ་འཁོར་ཆུས་འདེབས་ཞེས་བྱ་བ་གང་གིས་ན་སྲེག་པའི་བསྐལ་པའི་ཚེ་ཆར་འབེབས་པར་བྱེད་པ་དང་། རླུང་གི་དཀྱིལ་འཁོར་ལྷག་པར་སྐེམས་ཞེས་བྱ་བ་གང་གིས་ན་ཆུས་འཇིག་པ་དེ་ལྷག་པར་སྐེམས་པར་བྱེད་པ་ཡོད་དོ། །
en: Maudgalyāyana, in the ten directions there are the following maṇḍalas of wind: the wind called scattering; the wind called cutting asunder, which cuts the trichiliocosm asunder and, having cut it asunder, destroys it; the wind called dispersing and scattering, which moves about in the middle of the world; the wind called all-settling, which moves about at the summit of existence; the wind called destroying, which utterly destroys even Mount Meru, the king of mountains, let alone ordinary mountains; the wind called blazing, which arises during the conflagration of an eon and whose flames blaze all the way up to the Brahmā realms; the wind called consummating, which pacifies the fire at the eon’s conflagration; the wind called delighting, which completely covers the trichiliocosm with a lattice of clouds; the wind called sprinkling with water, which causes rain to descend during the conflagration of an eon; and the wind called completely drying, which completely dries that which has been destroyed by water.

source: མཽད་གལ་གྱི་བུ་ངས་རླུང་གི་དཀྱིལ་འཁོར་ལས་བརྩམས་ཏེ་བསྐལ་པ་འམ། བསྐལ་པ་ལས་ལྷག་པར་ཆོས་བསྟན་ཀྱང་དེ་བཞིན་གཤེགས་པས་རླུང་གི་དཀྱིལ་འཁོར་ལས་བརྩམས་ཏེ་ཆོས་བསྟན་པ་ལ་མཐའ་ཐུག་པ་མེད་དོ། །
en: “Maudgalyāyana, beginning with these maṇḍalas of wind, I could teach the Dharma for an eon or even longer than an eon, for there is no end to the Dharma taught by a tathāgata, beginning from the explanation of these maṇḍalas of wind.

source: སྒྱུ་མ་མཁན་བཟང་པོས་རླུང་གི་དཀྱིལ་འཁོར་དེ་དག་གི་ནང་དུ་འདུག་པར་ནུས་སམ། གསོལ་པ།
en: Would the illusionist Bhadra be able to remain in those maṇḍalas of wind?”

source: མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “No, he would not,” replied Maudgalyāyana.

source: མཽད་གལ་གྱི་བུ་ང་ནི་རླུང་གི་དཀྱིལ་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱི་ནང་དུ་སྤྱོད་ལམ་བཞིས་གནས་པར་བྱེད་དོ། །
en: The Blessed One continued, “Maudgalyāyana, I would be able to abide inside all those maṇḍalas of wind, all the while performing the four normal activities.

source: དེ་བཞིན་གཤེགས་པ་ནི་བཞེད་ན་རླུང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡུངས་འབྲུ་གཅིག་གི་ནང་དུ་འཇོག་པར་མཛད། འཇུག་པར་མཛད་ལ། ཡུངས་འབྲུ་དེ་ཡང་རྣམ་པར་འཇིག་པར་མི་འགྱུར་ཞིང་།
en: If the Tathāgata so wishes, he could make all those winds enter a single mustard seed, and still the mustard seed would not be destroyed.

source: ཡུངས་འབྲུ་དེའི་ནང་དུ་རླུང་གི་དཀྱིལ་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱི་བྱ་བ་ཐམས་ཅད་ཀྱང་ཉེ་བར་སྟོན་པར་མཛད་ལ། རླུང་དེ་དག་ཕན་ཚུན་ཐུག་པར་ཡང་མི་འགྱུར། ལྟུང་བར་ཡང་མི་འགྱུར་རོ། །
en: Indeed, he could let all the activities of all those winds be displayed inside the mustard seed, and yet they would neither collide with one another nor decrease.

source: མཽད་གལ་གྱི་བུ་ང་ནི་སྒྱུ་མའི་ཆོས་ཉིད་དེ་ལྟ་བུ་དང་དེ་མ་ཡིན་པ་གཞན་ཡང་ཚད་མེད་པ་དང་ལྡན་ནོ། །
en: “Maudgalyāyana, there is nothing like the nature of my power of illusion. Indeed, it is limitless.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་།
en: Venerable Mahāmaudgalyāyana and the entire assembly were amazed.

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ངག་འཐུན་པར་ཚིག་ཏུ་སྨྲས་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་དེ།
en: They bowed their heads to the feet of the Blessed One and said together with one voice, “Blessed One, we are indeed fortunate!

source: སྟོན་པ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ། འདི་ལྟར་དབང་ཆེ་བར་གྲགས་པ། འདི་ལྟར་མཐུ་ཆེ་བ་ནི་བདག་ཅག་གིས་རྙེད་པ་ལེགས་པར་རྙེད་ལགས་སོ། །
en: As the teacher possesses such superior magical power, such renown for being superior in might, and such superior power, we are indeed fortunate!

source: བཅོམ་ལྡན་འདས་གང་དག་དེ་བཞིན་གཤེགས་པའི་ཆོ་འཕྲུལ་འདི་ཐོས་ནས་མོས་པར་བགྱིད་ཅིང་མོས་པར་བགྱིས་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིད་པ་དེ་དག་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་པ་ལགས་སོ། །
en: Blessed One, those who hear of this miraculous display of the Tathāgata will be inspired. And being inspired, they will develop the mind intent on complete and perfect awakening, so they, too, will obtain excellent fortune!”
